
# coding: utf-8

# In[ ]:


'''
Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. 

Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета.

Однако Паша очень плохо считает в уме, поэтому попросил вас написать программу, которая проверит равенство сумм и 
выведет "Счастливый", если суммы совпадают, и "Обычный", если суммы различны.

На вход программе подаётся строка из шести цифр.

Выводить нужно только слово "Счастливый" или "Обычный", с большой буквы.
'''
s = str(input())
a = int(s[0])
b = int(s[1])
c = int(s[2])
d = int(s[3]) 
e = int(s[4])
f = int(s[5])
if a+b+c == d+e+f:
    print("Счастливый")
else:
    print("Обычный")

